tempDirs/tmpizbfw7sn/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


6
(
inletWater
{
    type patch;
    nFaces 96;
    startFace 665222;
}

outletWater
{
    type patch;
    nFaces 640;
    startFace 665318;
}

freeSurface
{
    type patch;
    nFaces 7938;
    startFace 665958;
}

leftSide
{
    type wall;
    nFaces 12512;
    startFace 673896;
}

rightSide
{
    type wall;
    nFaces 12512;
    startFace 686408;
}

bedWall
{
    type wall;
    nFaces 8242;
    startFace 698920;
}

)


// ************************************************************************* //
