tempDirs/tmpizbfw7sn/constant/turbulenceProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object turbulenceProperties;
}

simulationType RAS;

RAS
{
  RASModel kEpsilon;
  turbulence yes;
  printCoeffs yes;
  sigmaEps 0.9757715885354682;
} 	// ************************************************************************* //

